FinalDrive/0.org/alpha.water.org
/*----------------------------------------------------------------------------------*\
|                                                                                    | 
|    ANSA_VERSION: 14.0.0                                                            | 
|                                                                                    | 
|    file created by  A N S A  Mon Aug 15 14:28:13 2016                              | 
|                                                                                    | 
|    Output from: D:/work/N304-UAZ-reductor/cae-of/Untitled                          | 
|                                                                                    | 
\*----------------------------------------------------------------------------------*/



FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;


boundaryField
{

	"if_body_in_beams1_out|if_body_out_beams2_in|if_body_out_beams1_in|if_body_in_beams2_out"
	{
// 		type            cyclicAMI;
		type            zeroGradient;
	}
	
	"if_body_wheel|if_wheel_body"
	{
		type            cyclicAMI;
		value		$internalField;
	}

	wheel-wall
	{
		type            zeroGradient;
	}
	
	body-wall
	{
		type            zeroGradient;
	}
	
	beam1-wall
	{
		type            zeroGradient;
	}

	beam2-wall
	{
		type            zeroGradient;
	}

}
